---
kind: event
id: E:Autodesk.Revit.UI.ComboBox.DropDownClosed
source: html/a20fbfd0-d7ab-eefb-a3d1-38f22882f1ec.htm
---
# Autodesk.Revit.UI.ComboBox.DropDownClosed Event

Subscribe to this event to be notified when the drop-down of the ComboBox is closed.

## Syntax (C#)
```csharp
public event EventHandler<ComboBoxDropDownClosedEventArgs> DropDownClosed
```